"""Лекция 1:

1.1
    1) Установите Python и PyCharm
    2) Напишите и запустите программу. которая выводит строку  "Hello world!" 
    3) Напишите программу, которая на входе получает имя пользователя, cохраняет его в переменную user_name и выводит строку  "Hello {user_name}!" 

1.2
    1) Напишите программу, чтобы вывести:
      
*********
*            *
*            *
*********
"""
# 1.1.2
print("Hello, world!")

# 1.1.3
user_name = input()
print(f"Hello, {user_name}!")

# 1.2
print("*" * 9)
print("*", " " * 5, "*")
print("*", " " * 5, "*")
print("*" * 9)
